<?php

return [
    'unique' => 'Такое значение :attribute уже занято',
    'checkbox_required' => "Этот чекбокс обязательный",
    'not_correct_password' => 'Неверный пароль',
    'cart_empty' => 'Ваша корзина пустая. Пожалуйста, добавьте товары в корзину.',
    'customer_exists' => 'Пользователь с таким електронным адресом уже зарегистрирован, введите другой электронный адрес или выполните вход в личный кабинет',
    'address_required' => 'Введите адрес',
    'address_id_exists' => 'Не можем найти сохраненный адрес. Попробуйте выбрать другой'
];
